Documents/ИнвойсЗакупки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ИнвойсЗакупки</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ПлатежныйКалендарьЗакупки</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерИнвойсаПоставщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИнвойсаПоставщика</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНаСкладеОтправителя</Name>
					<Comment>Дата на складе отправителя</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИнспекции</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КтоИнспектировал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Авианакладная</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопРасходы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комиссия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛокальныйСтатус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыИнвойса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаОплатыВВалютеИнвойса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Недоплата</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаТТН</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перевозчик</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Перевозчики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МетодОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МетдыОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Счета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаОплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Оплаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>13</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Курс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>11</v8:Digits>
									<v8:FractionDigits>7</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВВалютеИнвойса</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Треки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Трек</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>22</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/СостоянияИнвойсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СостоянияИнвойсов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Расхождения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыИнвойса</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусИнспекции</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыИнспекции</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОплаты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусОплатыАвто</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Долги</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Инвойс</Name>
					<Type>
						<v8:Type>cfg:DocumentRef._Инвойс</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнвойсЗакупки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Треки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>Треки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтправленоУведомление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Ответ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Трек</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.НомерТрека</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Перевозчик</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Перевозчики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ХранилищеФайлов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ХранилищеФайлов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ХранилищеДвоичныхДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазмерФайла</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПутьФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ОбъектУИД</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектСсылка</Name>
					<Comment>Хранение ссылки на объект Не позволит штатными средствами удалить объект без очистки всех прикреплений</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВладелецПрисоединенныхФайлов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МестоХраненияФайлов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МестоХраненияПрикрепленныхФайлов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РасширениеИмениФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НазначениеФайла</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НазначениеФайлов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтатусыИнспекции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СтатусыИнспекции</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>InspectionDone</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>HaveSomeProblem</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>NotInspected</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусыОплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СтатусыОплаты</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>NotPaid</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PartlyPaid</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PaidNotReceivded</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Paid</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>WithoutPayment</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ИнвойсЗакупки/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ДействияФормы     

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Запрет копирования документа
    Если НЕ Параметры.ЗначениеКопирования.Пустая() Тогда
        Отказ = Истина;
        СтандартнаяОбработка = Ложь;
        Сообщение = Новый СообщениеПользователю;
        Сообщение.Текст = НСтр("ru = 'Копирование запрещено, создайте новый документ'; en = 'Copying is prohibited, create a new document'");
        Сообщение.Сообщить(); 
        Возврат;
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Запр = Новый Запрос;   
		Запр.УстановитьПараметр("ИнвойсЗакупки", Объект.Ссылка);
		Запр.Текст ="ВЫБРАТЬ РАЗРЕШЕННЫЕ
		            |	СостоянияИнвойсов.Статус КАК Статус,
		            |	СостоянияИнвойсов.СтатусИнспекции,
		            |	СостоянияИнвойсов.СтатусОплаты
		            |ИЗ
		            |	РегистрСведений.СостоянияИнвойсов КАК СостоянияИнвойсов
		            |ГДЕ
		            |	СостоянияИнвойсов.Инвойс = &ИнвойсЗакупки"; 
		Выборка = Запр.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			СтатусДокумента = Выборка.Статус;
			СтатусИнспекции = Выборка.СтатусИнспекции;
			СтатусОплаты	= Выборка.СтатусОплаты;
		КонецЕсли; 
	Иначе   
		//СтатусДокумента = Перечисления.СтатусыИнвойса.НеОтправлен;
		СтатусДокумента = Перечисления.СтатусыИнвойса.ПустаяСсылка();
		СтатусИнспекции = Перечисления.СтатусыИнспекции.NotInspected;
		СтатусОплаты 	= Перечисления.СтатусыОплаты.NotPaid;
	КонецЕсли;
	
	лРежим = РольДоступна("Администратор") 
			ИЛИ РольДоступна("ИнвойсЗакупки") 
			ИЛИ РольДоступна("МетреонПолный")
			ИЛИ РольДоступна("МетреонЛогистика");
	//Элементы.СтатусДокумента.ТолькоПросмотр = НЕ лРежим;
	Элементы.СтатусДокумента.ТолькоПросмотр = НЕ РольДоступна("Администратор");
	Элементы.СтатусИнспекции.ТолькоПросмотр = НЕ лРежим;
	Элементы.СтатусОплаты.ТолькоПросмотр = НЕ лРежим;
	
	Элементы.СкладОтправитель.СписокВыбора.Очистить();
	Элементы.СкладОтправитель.СписокВыбора.ЗагрузитьЗначения(ОбщегоНазначенияСервер.СкладыКонтрагентов(Истина,Ложь));
	Элементы.СкладПолучатель.СписокВыбора.Очистить();
	Элементы.СкладПолучатель.СписокВыбора.ЗагрузитьЗначения(ОбщегоНазначенияСервер.СкладыКонтрагентов(Ложь,Истина));
	
	лБыстрыйВыборВалют = ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("БыстрыйВыборВалют");
	Элементы.Валюта.БыстрыйВыбор 			= лБыстрыйВыборВалют; 
	Элементы.ВалютаОплаты.БыстрыйВыбор 		= лБыстрыйВыборВалют; 
	Элементы.ОплатыВалюта.БыстрыйВыбор  	= лБыстрыйВыборВалют;
	Элементы.ВалютаОплатыАвто.БыстрыйВыбор 	= лБыстрыйВыборВалют; 
	//глПокраситьВалюты(ЭтаФорма, "Валюта", "Оплаты"); 
	
	ЗаполнитьКэш();  
	
	//Файлы 		= ОбщегоНазначенияСервер.СтрокаФайлов(Объект.Ссылка, ПредопределенноеЗначение("Перечисление.НазначениеФайлов.Прочее"));	
	//ФайлыОплаты = ОбщегоНазначенияСервер.СтрокаФайлов(Объект.Ссылка, ПредопределенноеЗначение("Перечисление.НазначениеФайлов.Оплата"));
	//+++
	//ОбщегоНазначенияСервер.СформироватьГиперссылкиФайловНаФорме(Объект.Ссылка, 
	//															ЭтаФорма, 
	//															Элементы.ГруппаФайлы, 
	//															ПредопределенноеЗначение("Перечисление.НазначениеФайлов.Прочее"), 
	//															"НажатиеГиперссылкиФайла");
	//ОбщегоНазначенияСервер.СформироватьГиперссылкиФайловНаФорме(Объект.Ссылка, 
	//															ЭтаФорма, 
	//															Элементы.ГруппаФайлыОплаты, 
	//															ПредопределенноеЗначение("Перечисление.НазначениеФайлов.Оплата"), 
	//															"НажатиеГиперссылкиФайлаОплаты");
	СформироватьГиперссылкиФайловНаФорме();
	//---
	
	Элементы.ГруппаСостояние.Видимость = ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("ОтображатьСостояниеВФормеДокумента");
	ОбщегоНазначения.ОтобразитьСостояниеДокумента(Объект, СостояниеДокумента, КартинкаСостоянияДокумента); 
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.Валюта 			= ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("Валюта");
		Объект.СкладОтправитель = ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("СкладОтправителя");
	КонецЕсли;	
	
	Попытка
	ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.ФормаСоздатьНаОсновании.ПодчиненныеЭлементы.ФормаДокумент_ИнвойсСоздатьНаОсновании.Видимость = Ложь;
	Исключение
	КонецПопытки;
	
	Загл = НСтр("ru = 'Сумма в '; en = 'Sum in '") + ПараметрыСеанса.БазоваяВалюта;
	Элементы.СуммаОплатыВВалюте.Заголовок 			= Загл;
	Элементы.ОплатыСуммаВВалютеИнвойса.Заголовок 	= Загл;
	
	//Запр = Новый Запрос;
	//Запр.Текст = "ВЫБРАТЬ
	//             |	Сотрудники.Ссылка КАК Ссылка
	//             |ИЗ
	//             |	Справочник.Сотрудники КАК Сотрудники
	//             |ГДЕ
	//             |	НЕ Сотрудники.ПометкаУдаления
	//             |	И Сотрудники.Менеджер
	//             |АВТОУПОРЯДОЧИВАНИЕ";
	//Элементы.Менеджер.СписокВыбора.ЗагрузитьЗначения(Запр.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	Элементы.Менеджер.СписокВыбора.ЗагрузитьЗначения(омСервер.Менеджеры());
	
	//ОбновитьСтатусТрека();
	    запр = Новый Запрос;
		Запр.УстановитьПараметр("Перевозчик", Объект.Перевозчик);
		Запр.УстановитьПараметр("Трек", Объект.Авианакладная);
		запр.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		             |	Треки.Статус КАК Статус
		             |ИЗ
		             |	РегистрСведений.Треки КАК Треки
		             |ГДЕ
		             |	Треки.Трек = &Трек
		             |	И Треки.Перевозчик = &Перевозчик";
	    РезультатЗапроса = Запр.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда  
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			Элементы.ДекорацияСтатусТрека.Заголовок = Выборка.Статус;	
		КонецЕсли; 
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// © Primus1C  15.03.2024  НАЧАЛО ► 
	клФормаДокументаПриОткрытии(ЭтаФорма, Объект);
	//
	// === закомментирована работа с план.оплатами =====
	//
	Платежи = ?(Объект.Оплаты.Количество()<2, 1, 2);
	ПлатежиПриИзменении(Неопределено);
	//      
	
	СкрытьТреки(Неопределено);
	ОтобразитьКоличествоТреков();

	// © Primus1C  ОКОНЧАНИЕ ◄

	ОтобразитьРазницуИнвойсов();
	УстановитьВидимостьИнспекции();  
	УстановитьВидимостьПоСтатусуОплаты();
	ОтобразитьЦветСтатусов();
	ОтобразитьЦветВалюты();   
	//ОтобразитьРазницуОплат();
	//Элементы.Недоплата.ЦветРамки = ?(Объект.Недоплата=0, WebЦвета.ТемноЗеленый, WebЦвета.Красный);
	РассчитатьНедоплату(Истина);
	
	ВидимостьПанелиСообщений = ВидимостьПанелиСообщений И Сооб_Сервер.ПроверитьНаличиеРоли(гоПользователь());
	Элементы.КнопкаСообщения.Пометка = ВидимостьПанелиСообщений;
	ПоказатьСкрытьПанельСообщений();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Платежи = 1 Тогда
		Если Объект.Оплаты.Количество() = 0 Тогда
			СтрокаТЧ = Объект.Оплаты.Добавить();
		Иначе
			СтрокаТЧ = Объект.Оплаты[0];
		КонецЕсли; 		
		СтрокаТЧ.Сумма 					= СуммаОплаты;
		СтрокаТЧ.Валюта					= ВалютаОплаты_;
		СтрокаТЧ.Курс					= КурсОплаты;
		СтрокаТЧ.СуммаВВалютеИнвойса	= Объект.СуммаОплатыВВалютеИнвойса; 
	//Иначе
	//	Объект.СуммаОплатыВВалютеИнвойса = Объект.Оплаты.Итог("СуммаВВалютеИнвойса");
	КонецЕсли; 

	//Если Элементы.ГруппаТТН.Видимость Тогда // 1 трек
	//
	//Иначе // список треков	
	//
	//КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	ОбщегоНазначения.ОтобразитьСостояниеДокумента(Объект, СостояниеДокумента, КартинкаСостоянияДокумента); 
	РаботаСИнвойсами.ЗаписатьСтатусыИнвойса(Объект.Ссылка, СтатусДокумента, СтатусИнспекции, СтатусОплаты, , , , , Объект.Ссылка);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновитьСтрокуПрикреплений" Тогда
		СформироватьГиперссылкиФайловНаФорме();
	ИначеЕсли ИмяСобытия = "ИзмененСтатусОплаты" Тогда 
		СтатусОплаты = Параметр;
		СтатусОплатыПриИзменении(Неопределено);
		
	КонецЕсли;
	
КонецПроцедуры 

#КонецОбласти	   


#Область СобытияЭлементовФормы

&НаКлиенте
Процедура СтатусДокументаПриИзменении(Элемент)
	
	ОтобразитьЦветСтатусов();

КонецПроцедуры

&НаКлиенте
Процедура ЛокальныйСтатусПриИзменении(Элемент)

	ОтобразитьЦветСтатусов();

КонецПроцедуры

&НаКлиенте
Процедура СтатусИнспекцииПриИзменении(Элемент)

	УстановитьВидимостьИнспекции();
	Если СтатусИнспекции <> ПредопределенноеЗначение("Перечисление.СтатусыИнспекции.NotInspected") и Объект.ДатаИнспекции = Дата(1,1,1) Тогда
		Объект.ДатаИнспекции = ОбщегоНазначенияСервер.Сейчас(); 
		Объект.КтоИнспектировал = гоПользователь();
	КонецЕсли;              
	ОтобразитьЦветСтатусов();

КонецПроцедуры

&НаКлиенте
Процедура ДатаИнспекцииПриИзменении(Элемент)
	Объект.КтоИнспектировал = гоПользователь();
КонецПроцедуры

&НаКлиенте
Процедура ДатаОплатыПриИзменении(Элемент) 
	
	Если Объект.Оплаты.Количество() = 0 Тогда
		СтрокаТЧ = Объект.Оплаты.Добавить();
	Иначе
		СтрокаТЧ = Объект.Оплаты[0];
	КонецЕсли;  
	СтрокаТЧ.Дата = Объект.ДатаОплаты;  
	
	ОтобразитьРазницуИнвойсов(); 
	УстановитьВидимостьИнспекции();
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	ОтобразитьРазницуИнвойсов();  
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрольНажатие(Элемент)  
	
	Если КэшДанных = Неопределено Тогда
		Возврат;	
	КонецЕсли;	
	
	Ключ = СтрЗаменить(Элемент.Имя, "Контроль", ""); 
	Если ТипЗнч(КэшДанных[Ключ]) = Тип("Дата") Тогда 
		Если КэшДанных[Ключ] = Дата(1,1,1) Тогда
		  	лЗнач = НСтр("ru = '<не задана>'; en = '<not specified>'");
		Иначе
			лЗнач = Формат(КэшДанных[Ключ], "ДФ=dd.MM.yyyy");
		КонецЕсли;
	Иначе
	   лЗнач = КэшДанных[Ключ] 
	КонецЕсли;
	 
	Сообщить(Элемент.Заголовок + НСтр("ru = ' в инвойсе: '; en = ' in invoice: '") + лЗнач, СтатусСообщения.Информация);  
	
КонецПроцедуры

&НаКлиенте
Процедура НомерИнвойсаПоставщикаПриИзменении(Элемент)
	
	ОтобразитьРазницуИнвойсов();  
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаИнвойсаПоставщикаПриИзменении(Элемент)
	
	ОтобразитьРазницуИнвойсов();  
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаПриИзменении(Элемент)
	
	ОтобразитьРазницуИнвойсов();  
	РассчитатьНедоплату();
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	
	ОтобразитьРазницуИнвойсов();  
	Если НЕ ЗначениеЗаполнено(ВалютаОплаты_) Тогда
		ВалютаОплаты_ = Объект.Валюта;	
	КонецЕсли; 
	РассчитатьНедоплату();
	ОтобразитьЦветВалюты();   
	
КонецПроцедуры

&НаКлиенте
Процедура КоличествоПриИзменении(Элемент)
	
	ОтобразитьРазницуИнвойсов();  
	
КонецПроцедуры

&НаКлиенте
Процедура ФайлыНажатие(Элемент, СтандартнаяОбработка) 
	
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("РегистрСведений.ХранилищеФайлов.Форма.УпрФормаСписка", 
				Новый Структура("ОбъектУИД,Владелец,НазначениеФайла", 
								ЭтаФорма.Объект.Ссылка.УникальныйИдентификатор(), 
								ЭтаФорма.Объект.Ссылка,
								?(Элемент.Имя="Файлы", ПредопределенноеЗначение("Перечисление.НазначениеФайлов.Прочее"), ПредопределенноеЗначение("Перечисление.НазначениеФайлов.Оплата"))), 
				ЭтаФорма);

КонецПроцедуры


&НаКлиенте
Процедура ВалютаОплатыПриИзменении(Элемент)
	
	ПересчитатьВалютныеСуммы(ВалютаОплаты_, КурсОплаты, СуммаОплаты, Объект.СуммаОплатыВВалютеИнвойса);

	//Если Объект.Валюта = ВалютаОплаты Тогда
	//	КурсОплаты = 1;
		РассчитатьНедоплату();
	//КонецЕсли;

	ОтобразитьЦветВалюты();   

КонецПроцедуры

&НаКлиенте
Процедура СуммаОплатыПриИзменении(Элемент)
	
	ПересчитатьВалютныеСуммы(ВалютаОплаты_, КурсОплаты, СуммаОплаты, Объект.СуммаОплатыВВалютеИнвойса);

КонецПроцедуры

&НаКлиенте
Процедура КурсОплатыПриИзменении(Элемент)
	
	ПересчитатьВалютныеСуммы(ВалютаОплаты_, КурсОплаты, СуммаОплаты, Объект.СуммаОплатыВВалютеИнвойса);
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусОплатыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)      
	
	СтатусОплатыПередИзменением = СтатусОплаты;    
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусОплатыПриИзменении(Элемент) Экспорт 

	Если Объект.ДатаОплаты = Дата(1,1,1) И
		  (СтатусОплаты = ПредопределенноеЗначение("Перечисление.СтатусыОплаты.PartlyPaid") ИЛИ 
			СтатусОплаты = ПредопределенноеЗначение("Перечисление.СтатусыОплаты.PaidNotReceivded") ИЛИ 
			СтатусОплаты = ПредопределенноеЗначение("Перечисление.СтатусыОплаты.Paid"))
					Тогда
		Объект.ДатаОплаты = ОбщегоНазначенияСервер.Сейчас(); 
		ДатаОплатыПриИзменении(Неопределено);
	КонецЕсли;
	
	Если СтатусОплаты = ПредопределенноеЗначение("Перечисление.СтатусыОплаты.NotPaid") Тогда
		Объект.ДатаОплаты = Дата(1,1,1); 
		ДатаОплатыПриИзменении(Неопределено);
	КонецЕсли;

	УстановитьВидимостьПоСтатусуОплаты();

	ОтобразитьЦветСтатусов();

КонецПроцедуры

&НаКлиенте
Процедура СуммаОплатыВВалютеПриИзменении(Элемент)
	
	РассчитатьНедоплату();
	
КонецПроцедуры

#КонецОбласти  


#Область СобытияТЧ

&НаКлиенте
Процедура ПлатежиПриИзменении(Элемент)
	
	Если Элемент <> Неопределено Тогда // нажатие переключателя
		Если Платежи = 1 И Объект.Оплаты.Количество() > 1 Тогда
			клПредупреждение(НСтр("ru = 'Сначала удалите строки с ненужными платежами!'; en = 'First, remove lines with unnecessary payments!'"), 10, НСтр("ru = 'Оплаты инвойса'; en = 'Invoice payments'"));
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	лОдинПлатеж = Платежи = 1;
	Элементы.ГруппаОднаОплата.Видимость 	= лОдинПлатеж;
	Элементы.ГруппаНесколькоОплат.Видимость = НЕ лОдинПлатеж;
	Если лОдинПлатеж Тогда 
		Если Объект.Оплаты.Количество() = 0 Тогда
			Если Объект.ДатаОплаты<> Дата(1,1,1) ТОгда
				Объект.ДатаОплаты		= Дата(1,1,1); 
			КонецЕсли;
			СуммаОплаты					= 0;
			ВалютаОплаты_				= ПредопределенноеЗначение("Справочник.Валюты.ПустаяСсылка");
			КурсОплаты					= 0;
			СуммаОплатыВВалютеИнвойса	= 0;
		Иначе	
			СтрокаТЧ = Объект.Оплаты[0];        
			Если Объект.ДатаОплаты <> СтрокаТЧ.Дата Тогда
				Объект.ДатаОплаты		= СтрокаТЧ.Дата;
			КонецЕсли;
			СуммаОплаты					= СтрокаТЧ.Сумма;
			ВалютаОплаты_				= СтрокаТЧ.Валюта;
			КурсОплаты					= СтрокаТЧ.Курс;
			СуммаОплатыВВалютеИнвойса	= СтрокаТЧ.СуммаВВалютеИнвойса;
		КонецЕсли;
	Иначе	
		Если Элемент <> Неопределено Тогда // нажатие переключателя
			Если Объект.Оплаты.Количество() = 0 Тогда
				СтрокаТЧ = Объект.Оплаты.Добавить();
			Иначе
				СтрокаТЧ = Объект.Оплаты[0];
			КонецЕсли;
			СтрокаТЧ.Дата 					= Объект.ДатаОплаты;
			СтрокаТЧ.Сумма 					= СуммаОплаты;
			СтрокаТЧ.Валюта 				= ВалютаОплаты_;
			СтрокаТЧ.Курс 					= КурсОплаты;
			СтрокаТЧ.СуммаВВалютеИнвойса	= СуммаОплатыВВалютеИнвойса; 
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры  
  
&НаКлиенте
Процедура ОплатыСуммаПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Оплаты.ТекущиеДанные;
	ПересчитатьВалютныеСуммы(ТекСтрока.Валюта, ТекСтрока.Курс, ТекСтрока.Сумма, ТекСтрока.СуммаВВалютеИнвойса);
	
КонецПроцедуры

&НаКлиенте
Процедура ОплатыКурсПриИзменении(Элемент)

	ТекСтрока = Элементы.Оплаты.ТекущиеДанные;
	ПересчитатьВалютныеСуммы(ТекСтрока.Валюта, ТекСтрока.Курс, ТекСтрока.Сумма, ТекСтрока.СуммаВВалютеИнвойса);
	//Объект.СуммаОплаты = Объект.Оплаты.Итог("СуммаВВалютеИнвойса");
	
КонецПроцедуры

&НаКлиенте
Процедура ОплатыСуммаВВалютеИнвойсаПриИзменении(Элемент)

	РассчитатьНедоплату();

КонецПроцедуры

&НаКлиенте
Процедура ОплатыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)

	//Платежи = ?(Объект.Оплаты.Количество()<2, 1, 2);
    ОтобразитьРазницуИнвойсов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОплатыПослеУдаления(Элемент)

	Платежи = ?(Объект.Оплаты.Количество()<2, 1, 2);
    ПлатежиПриИзменении(Неопределено);

КонецПроцедуры

&НаКлиенте
Процедура ОплатыПередНачаломИзменения(Элемент, Отказ)

	//Платежи = ?(Объект.Оплаты.Количество()<2, 1, 2);

КонецПроцедуры

#КонецОбласти


#Область Служебные

&НаКлиенте
Процедура УстановитьВидимостьПоСтатусуОплаты()
	
	Элты = Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы; 
	Если Элты.Найти("ФормаДокументИнвойсЗакупкиОплатить") <> Неопределено Тогда
		Элты.ФормаДокументИнвойсЗакупкиОплатить.Доступность = СтатусОплаты <> ПредопределенноеЗначение("Перечисление.СтатусыОплаты.Paid");
	КонецЕсли;  
	Если Элты.Найти("ФормаДокументИнвойсЗакупкиОтменитьОплату") <> Неопределено Тогда
		Элты.ФормаДокументИнвойсЗакупкиОтменитьОплату.Доступность = СтатусОплаты <> ПредопределенноеЗначение("Перечисление.СтатусыОплаты.NotPaid");
	КонецЕсли;  

КонецПроцедуры

&НаКлиенте 
Процедура ПересчитатьВалютныеСуммы(ЭлементВалюта, ЭлементКурс, ЭлементСумма, ЭлементСуммаВВалюте)
	
	Если ЭлементВалюта = гоПараметрСеанса("БазоваяВалюта") Тогда
		ЭлементСуммаВВалюте = ЭлементСумма;
	Иначе	
		Если ЭлементКурс <> 0 Тогда
			ЭлементСуммаВВалюте = ЭлементСумма / ЭлементКурс;
		КонецЕсли;
	КонецЕсли; 
	РассчитатьНедоплату();
	
КонецПроцедуры

&НаКлиенте 
Процедура ОшибкаРасчетаНедоплаты(ТекстСообщения, Недопл, Ошибка=Ложь)

	клНамекнуть("Недоплата", ТекстСообщения, БиблиотекаКартинок.ВниманиеКрасный);
	Элементы.ДекорацияНедоплата.Заголовок = СтрШаблон("%1   ???", Формат(Недопл, "ЧДЦ=2; ЧН=ОК"));
    Ошибка = Истина;
	
КонецПроцедуры	
	
&НаКлиенте 
Процедура РассчитатьНедоплату(ТолькоОтобразить=Ложь)
	
	//Элементы.КурсОплаты.Видимость =  Объект.Валюта = ВалютаОплаты 
	
	//Если КурсОплаты = 0 ИЛИ НЕ ЗначениеЗаполнено(Объект.Валюта) Тогда
	//    Элементы.Недоплата.Видимость = Ложь;
	//Иначе	 
	
		//Элементы.Недоплата.Видимость = Истина;  
		лНедоплата = Объект.Недоплата; 
		лЕстьОшибка = Ложь;
		Элементы.ДекорацияНедоплата.Заголовок = "";

		лДоллар = гоПараметрСеанса("БазоваяВалюта");
		Если Объект.Валюта = лДоллар И ВалютаОплаты_ = лДоллар Тогда
			лНедоплата = Объект.СуммаОплатыВВалютеИнвойса - Объект.Сумма;
		ИначеЕсли Объект.Валюта = ВалютаОплаты_ Тогда
			Если СуммаОплаты = Объект.Сумма Тогда
				лНедоплата = 0;	         
			ИначеЕсли БазоваяВалютаДоллар(Объект.Валюта) Тогда
				лНедоплата = (СуммаОплаты - Объект.Сумма) / гоКурс(Объект.Валюта, Объект.Фирма, Объект.Дата);
			Иначе	
				ОшибкаРасчетаНедоплаты(СтрШаблон("Расчет недоплаты невозможен: нет данных о курсах %1 - %2 !", Объект.Валюта, лДоллар), лНедоплата, лЕстьОшибка);
			КонецЕсли;
		ИначеЕсли Объект.Валюта = лДоллар Тогда
			Если КурсОплаты = 0 Тогда
				ОшибкаРасчетаНедоплаты("Невозможно рассчитать недоплату: не заполнен курс!", лНедоплата, лЕстьОшибка);
			Иначе	
				//лНедоплата = ?(КурсОплаты=0, 0, Объект.СуммаОплатыВВалютеИнвойса / КурсОплаты - Объект.Сумма );	
				лНедоплата = ?(КурсОплаты=0, 0, Объект.СуммаОплатыВВалютеИнвойса - Объект.Сумма );	
			КонецЕсли;
		ИначеЕсли ВалютаОплаты_ = лДоллар Тогда
			Если КурсОплаты = 0 Тогда
				ОшибкаРасчетаНедоплаты("Невозможно рассчитать недоплату: не заполнен курс!", лНедоплата, лЕстьОшибка);
			Иначе	
				лНедоплата = Объект.Сумма * КурсОплаты - Объект.СуммаОплатыВВалютеИнвойса;   
			КонецЕсли;    
		Иначе // не приводится к доллару
			ОшибкаРасчетаНедоплаты("Невозможно рассчитать недоплату: не заполнен курс!", лНедоплата, лЕстьОшибка);
		КонецЕсли;
		
		//Объект.Недоплата = Объект.СуммаОплатыВВалютеИнвойса - Объект.Сумма / КурсОплаты;
		//Элементы.Недоплата.ЦветРамки = ?(Объект.Недоплата=0, WebЦвета.ТемноЗеленый, WebЦвета.Красный);
		//////Если Элементы.ДекорацияНедоплата.Заголовок <> "" Тогда
		//////	Элементы.ДекорацияНедоплата.Заголовок = Формат(Объект.Недоплата, "ЧДЦ=2; ЧН=ОК"); 
		//////КонецЕсли;
	//КонецЕсли;
	
	лЦвет = ?(лНедоплата=0 И НЕ лЕстьОшибка, WebЦвета.ТемноЗеленый, WebЦвета.Красный);
	Элементы.ДекорацияНедоплата.ЦветТекста = лЦвет;
	Элементы.ДекорацияНедоплата.ЦветРамки = лЦвет;

	Если НЕ ТолькоОтобразить Тогда
		Объект.Недоплата = лНедоплата;
	КонецЕсли;

	Если НЕ лЕстьОшибка Тогда
		Элементы.ДекорацияНедоплата.Заголовок = Формат(Объект.Недоплата, "ЧДЦ=2; ЧН=ОК"); 
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция БазоваяВалютаДоллар(Вал)

	Возврат Вал.БазоваяВалюта = ПараметрыСеанса.БазоваяВалюта;	

КонецФункции 


//&НаСервере
//Функция СуммаВДолларах(Знач Сумма, Знач Валюта, Знач Курс = 0)
//	
//	Если Не ЗначениеЗаполнено(Валюта) Тогда
//		Возврат 0;
//	КонецЕсли; 
//	Если Курс <> 0 Тогда
//		Возврат Сумма / Курс;
//	КонецЕсли;
//	
//	Если Валюта = ПараметрыСеанса.БазоваяВалюта Тогда
//		Возврат Сумма;	
//	Иначе
//		Если Валюта.БазоваяВалюта = ПараметрыСеанса.БазоваяВалюта Тогда         
//			ДатаКурса = ?(Объект.Ссылка = Неопределено, ТекущаяДата(), Объект.Дата); 
//			Курс = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(ДатаКурса, Новый Структура("Валюта,Фирма",Валюта,ПараметрыСеанса.Фирма)).Курс;
//			Возврат Сумма / Курс;
//		Иначе
//			Сообщить("Расчет невозможен: нет сведений о курсах "+Валюта+"-USD!");
//			Возврат 0;			
//		КонецЕсли;
//	КонецЕсли;	
//
//КонецФункции 

 &НаКлиенте
Процедура ОтобразитьЦветВалюты() 
	
	Если КэшЦветов.РаскрашиватьВалюты Тогда
		Элементы.Валюта.ЦветФона = КэшЦветов.ЦветаВалют.Получить(Объект.Валюта);
		Элементы.ВалютаОплаты.ЦветФона = КэшЦветов.ЦветаВалют.Получить(ВалютаОплаты_);
		Элементы.ВалютаОплатыАвто.ЦветФона = КэшЦветов.ЦветаВалют.Получить(ВалютаОплаты_);
	КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьЦветСтатусов()
	
	Если КэшЦветов.РаскрашиватьСтатусы Тогда
		Попытка
		Элементы.СтатусДокумента.ЦветФона	= КэшЦветов.ЦветаСтатусов.Получить(Строка(СтатусДокумента)); 
		Исключение
		КонецПопытки;
		Элементы.ЛокальныйСтатус.ЦветФона	= КэшЦветов.ЦветаСтатусов.Получить(Строка(Объект.ЛокальныйСтатус));
		Элементы.СтатусИнспекции.ЦветФона 	= КэшЦветов.ЦветаСтатусов.Получить(Строка(СтатусИнспекции)); 
		Элементы.СтатусОплаты.ЦветФона		= КэшЦветов.ЦветаСтатусов.Получить(Строка(СтатусОплаты));
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКэш()
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда

		Запр = Новый Запрос;
		Запр.УстановитьПараметр("ДокументОснование", Объект.Ссылка);
		Запр.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		             |	Инвойс.ВКД_НомерИнвойсаПоставщика КАК НомерИнвойсаПоставщика,
		             |	Инвойс.ВКД_ДатаИнвойсаПоставщика КАК ДатаИнвойсаПоставщика,
		             |	СУММА(ВЫБОР
		             |			КОГДА Инвойс.ТолькоУслуги
		             |				ТОГДА 0
		             |			ИНАЧЕ Инвойс.ВКД_Количество
		             |		КОНЕЦ) КАК Количество,
		             |	СУММА(Инвойс.Сумма) КАК Сумма,
		             |	Инвойс.Контрагент КАК Контрагент,
		             |	Инвойс.Валюта КАК Валюта,
		             |	Инвойс.Курс КАК Курс
		             |ИЗ
		             |	Документ._Инвойс КАК Инвойс
		             |ГДЕ
		             |	Инвойс.ДокументОснование = &ДокументОснование
		             |	И НЕ Инвойс.ПометкаУдаления
		             |
		             |СГРУППИРОВАТЬ ПО
		             |	Инвойс.ВКД_НомерИнвойсаПоставщика,
		             |	Инвойс.ВКД_ДатаИнвойсаПоставщика,
		             |	Инвойс.Контрагент,
		             |	Инвойс.Валюта,
		             |	Инвойс.Курс";
		Выгрузка = Запр.Выполнить().Выгрузить();
		Если Выгрузка.Количество() = 0 Тогда   
		    КэшДанных = Неопределено;
		Иначе
			КэшДанных = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Выгрузка[0], "Валюта,Курс"); 
			КэшДанных.Сумма = КэшДанных.Сумма * Выгрузка[0].Курс;
		КонецЕсли; 
		
		
	Иначе
	    КэшДанных = Неопределено;
	КонецЕсли;                     
	
	КэшЦветов = Новый Структура;
    КэшЦветов.Вставить("РаскрашиватьВалюты", 	ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("РаскрашиватьВалюты"));
	КэшЦветов.Вставить("ЦветаВалют", 			ОбщегоНазначенияПовтИсп.ЦветаВалют());
    КэшЦветов.Вставить("РаскрашиватьСтатусы", 	ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("РаскрашиватьСтатусыВФормеДокумента"));
	КэшЦветов.Вставить("ЦветаСтатусов", 		ОбщегоНазначенияПовтИсп.ЦветаСтатусов());
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьРазницуИнвойсов()

	Если КэшДанных = Неопределено Тогда
		Возврат;	
	КонецЕсли;	
	
	Для каждого Эл Из КэшДанных Цикл  
		Если ТипЗнч(Эл.Значение) = Тип("Число") Тогда
			лРавны = Объект[Эл.Ключ] - Эл.Значение;
		    Если лРавны < 0 Тогда
				лРавны = - лРавны;
			КонецЕсли;
			//лРавны = лРавны < 0.01;
			лРавны = лРавны < 0.9;
		Иначе
			лРавны = Объект[Эл.Ключ] = Эл.Значение;
		КонецЕсли;
		
		Если лРавны Тогда
			Элементы["Контроль"+Эл.Ключ].Картинка = БиблиотекаКартинок.ОформлениеЗнакФлажок;	
		Иначе	
			Элементы["Контроль"+Эл.Ключ].Картинка = БиблиотекаКартинок.ОформлениеЗнакКрест;	
		КонецЕсли;	
	КонецЦикла;
	
	//лДатаОплаты = ?(Объект.Оплаты.Количество() = 0, Дата(1,1,1),  Объект.Оплаты[0].Дата); 
	//Элементы.ОплатыДата.КартинкаШапки = ?(КэшДанных.ДатаОплаты = лДатаОплаты, БиблиотекаКартинок.ОформлениеЗнакФлажок, БиблиотекаКартинок.ОформлениеЗнакКрест);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьИнспекции()

	лРежим = ЗначениеЗаполнено(СтатусИнспекции) И СтатусИнспекции <> ПредопределенноеЗначение("Перечисление.СтатусыИнспекции.NotInspected"); 
	Элементы.ДатаИнспекции.Видимость 	= лРежим;
	Элементы.КтоИнспектировал.Видимость = лРежим;

КонецПроцедуры

#КонецОбласти 


#Область РаботаСФайлами 

//+++               

&НаКлиенте
Процедура НажатиеГиперссылкиФайла(Элемент, СтандартнаяОбработка) 
	
	ПараметрыФормы = Новый Структура("ВладелецСсылка, НазначениеФайла, ИмяАктивнойГиперссылки, ДобавлениеФайла", 
									Объект.Ссылка, 
									ПредопределенноеЗначение("Перечисление.НазначениеФайлов.Прочее"),
									?(Элемент=Неопределено, "", Элемент.Имя),
									Элемент=Неопределено);
	ОткрытьФорму("Обработка.Предпросмотр.Форма.ФормаПредпросмотра", ПараметрыФормы, ЭтаФорма,,,, );

КонецПроцедуры

&НаКлиенте
Процедура НажатиеГиперссылкиФайлаОплаты(Элемент, СтандартнаяОбработка) 
	
	ПараметрыФормы = Новый Структура("ВладелецСсылка, НазначениеФайла, ИмяАктивнойГиперссылки, ДобавлениеФайла", 
									Объект.Ссылка, 
									ПредопределенноеЗначение("Перечисление.НазначениеФайлов.Оплата"),
									?(Элемент=Неопределено, "", Элемент.Имя),
									Элемент=Неопределено);
	ОткрытьФорму("Обработка.Предпросмотр.Форма.ФормаПредпросмотра", ПараметрыФормы, ЭтаФорма,,,, );

КонецПроцедуры

&НаСервере
Процедура СформироватьГиперссылкиФайловНаФорме() 

	ОбщегоНазначенияСервер.СформироватьГиперссылкиФайловНаФорме(Объект.Ссылка, 
																ЭтаФорма, 
																Элементы.ГруппаФайлы, 
																Перечисления.НазначениеФайлов.Прочее, 
																"НажатиеГиперссылкиФайла");
	ОбщегоНазначенияСервер.СформироватьГиперссылкиФайловНаФорме(Объект.Ссылка, 
																ЭтаФорма, 
																Элементы.ГруппаФайлыОплаты, 
																Перечисления.НазначениеФайлов.Оплата, 
																"НажатиеГиперссылкиФайлаОплаты");

КонецПроцедуры

//---

&НаКлиенте
Процедура ДобавитьФайл(Команда)
	
	СтандартнаяОбработка = Ложь;
	НажатиеГиперссылкиФайла(Неопределено, СтандартнаяОбработка) 

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьФайлОплаты(Команда)

	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаВыбораФайла", ЭтаФорма, ПредопределенноеЗначение("Перечисление.НазначениеФайлов.Оплата"));
	НачатьПомещениеФайла(ОписаниеОповещения,,, Истина, ЭтотОбъект.УникальныйИдентификатор); 

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораФайла(ЕстьВыборПользователя, Адрес, ВыбранноеИмяФайла, ДопПараметры) Экспорт 
	
	Если ЕстьВыборПользователя = Ложь Тогда
        Возврат;
    КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОбработкаВыбораФайлаПрикрепить(Адрес, ВыбранноеИмяФайла, ДопПараметры);
		Возврат;
	КонецЕсли;
	
	клДаНет(Новый ОписаниеОповещения("ОбработкаВыбораФайлаПослеЗаписи", ЭтотОбъект, 
			Новый Структура("Адрес, ВыбранноеИмяФайла, ДопПараметры", Адрес, ВыбранноеИмяФайла, ДопПараметры)),
		НСтр("ru = 'Инвойс еще не записан. Записать его и прикрепить файл?'; en = 'The invoice has not yet been saved. Record it and attach the file?'"));
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораФайлаПослеЗаписи(Результат, Параметры) Экспорт
	Если НЕ Результат Тогда Возврат КонецЕсли;
	
	Записать();
	ОбработкаВыбораФайлаПрикрепить(Параметры.Адрес, Параметры.ВыбранноеИмяФайла, Параметры.ДопПараметры);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораФайлаПрикрепить(Адрес, ВыбранноеИмяФайла, ДопПараметры)
	Если ОбщегоНазначенияСервер.ПолучитьТипКлиента() = "WebServerExtension" Тогда
		//в параметре "ВыбранноеИмяФайла" строка имени файла без полного пути, например: name.ext
		л_ОписаниеФайла = Новый Структура();
		л_ОписаниеФайла.Вставить("Имя", 				ВыбранноеИмяФайла);
		л_ОписаниеФайла.Вставить("ИмяБезРасширения", 	ОбщегоНазначения.ПолучитьИмяБезРасширения(ВыбранноеИмяФайла));
		л_ОписаниеФайла.Вставить("ПолноеИмя", 			"");
		л_ОписаниеФайла.Вставить("Путь", 				"");
		л_ОписаниеФайла.Вставить("Расширение", 			ОбщегоНазначения.ПолучитьРасширение(ВыбранноеИмяФайла));
		л_ОписаниеФайла.Вставить("Размер", 				ПолучитьИзВременногоХранилища(Адрес).Размер());
		л_ОписаниеФайла.Вставить("Назначение", 			ДопПараметры);
		//л_ОписаниеФайла.Вставить("АдресВременногоХранилища",Адрес);

		л_Отказ			= Ложь;
		л_Сообщение		= "";
		л_КлючЗаписи	= Новый Структура("ОбъектУИД,ОбъектСсылка,МестоХраненияФайлов,ИмяФайла,РасширениеИмениФайла,Автор");
		
		//ДобавитьВложенныйФайл(Адрес, ВладелецФормы.Объект.Ссылка, л_ОписаниеФайла, л_Отказ, , л_КлючЗаписи, л_Сообщение);
		ОбщегоНазначенияСервер.ДобавитьВложенныйФайл(Адрес, Объект.Ссылка, л_ОписаниеФайла, л_Отказ, , л_КлючЗаписи, л_Сообщение);
		
		Если НЕ л_Отказ Тогда 
			ЭтаФорма.ОтобразитьИзменениеДанных(л_КлючЗаписи, ВидИзмененияДанных.Добавление);
			Оповестить("ОбновитьСтрокуПрикреплений", л_ОписаниеФайла.Имя, ЭтаФорма);
		КонецЕсли;
		
		Если НЕ ПустаяСтрока(л_Сообщение) Тогда
			Сообщить(л_Сообщение);
		КонецЕсли;
		
	Иначе 		
		
		л_Файл = Новый Файл(ВыбранноеИмяФайла);
		л_ОписаниеФайла = Новый Структура("Имя,ИмяБезРасширения,ПолноеИмя,Путь,Расширение");
		ЗаполнитьЗначенияСвойств(л_ОписаниеФайла, л_Файл);
		л_ОписаниеФайла.Вставить("Размер",					0);
		л_ОписаниеФайла.Вставить("Файл",					л_Файл);
		л_ОписаниеФайла.Вставить("АдресВременногоХранилища",Адрес);
		л_ОписаниеФайла.Вставить("Назначение", 				ДопПараметры);
		
		л_Файл.НачатьПроверкуСуществования(Новый ОписаниеОповещения("ПослеПроверкиСуществованияФайла", ЭтаФорма, л_ОписаниеФайла));
		
	КонецЕсли;
	
КонецПроцедуры // ПослеПомещенияФайлаВоВременноеХранилище()

&НаКлиенте
Процедура ПослеПроверкиСуществованияФайла(ФайлСуществует, ПараметрыФайла) Экспорт 
	
	Если ФайлСуществует Тогда 
		ПараметрыФайла.Файл.НачатьПолучениеРазмера(Новый ОписаниеОповещения("ПослеПолученияРазмераФайла", ЭтаФорма, ПараметрыФайла));
	Иначе 
		клОшибка(СтрШаблон( НСтр("ru = 'Папка %1 не существует!'; en = 'Folder %1 does not exist!'"), ПараметрыФайла.Путь)); 
	КонецЕсли;  
	
КонецПроцедуры // ПослеПроверкиСуществованияФайла()

&НаКлиенте
Процедура ПослеПолученияРазмераФайла(Результат, Параметр) Экспорт
	
	Параметр.Размер = Результат;
	
	//удалить свойство структуры "Файл" т.к. оно вызывает ошибку преобразования данных XDTO: Отсутствует отображение для типа 'Файл'
	Параметр.Удалить("Файл");
	
	л_Отказ		= Ложь;
	л_Сообщение	= "";
	л_КлючЗаписи= Новый Структура("ОбъектУИД,ОбъектСсылка,МестоХраненияФайлов,ИмяФайла,РасширениеИмениФайла,Автор,НазначениеФайла");
	
	//ДобавитьВложенныйФайл(Параметр.АдресВременногоХранилища, ВладелецФормы.Объект.Ссылка, Параметр,л_Отказ,,л_КлючЗаписи,л_Сообщение);
	ОбщегоНазначенияСервер.ДобавитьВложенныйФайл(Параметр.АдресВременногоХранилища, Объект.Ссылка, Параметр, л_Отказ, , л_КлючЗаписи, л_Сообщение);
		
	Если НЕ л_Отказ Тогда 
		ЭтаФорма.ОтобразитьИзменениеДанных(л_КлючЗаписи, ВидИзмененияДанных.Добавление);
		Оповестить("ОбновитьСтрокуПрикреплений", Параметр.Имя, ЭтаФорма);
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(л_Сообщение) Тогда
		Сообщить(л_Сообщение);
	КонецЕсли;   
	
КонецПроцедуры 

#КонецОбласти  


#Область Сообщения

&НаКлиенте
Процедура НажатиеКнопкиОтобразитьСообщения(Команда)

	ВидимостьПанелиСообщений = НЕ ВидимостьПанелиСообщений;
	Элементы.КнопкаСообщения.Пометка = ВидимостьПанелиСообщений;
	ПоказатьСкрытьПанельСообщений();
	
КонецПроцедуры  

&НаКлиенте
Процедура ПоказатьСкрытьПанельСообщений()

	Элементы.ГруппаСообщения.Видимость = ВидимостьПанелиСообщений;
	Если ВидимостьПанелиСообщений Тогда
		ОбновитьСообщенияНаФорме();
		ПодключитьОбработчикОжидания("ОбновитьСообщенияНаФорме", Сооб_Сервер.ПериодОбновленияЧата(), Ложь);
	Иначе
	    ОтключитьОбработчикОжидания("ОбновитьСообщенияНаФорме");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СообщПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	ИД = ДанныеСобытия.Element.id;
	//Сообщить(ИД);
	
	Если Лев(ИД, 7) = "answer_" Тогда
		Сооб_Клиент.СоздатьЗаписьРССообщения(ПредопределенноеЗначение("Перечисление.Сооб_ТипСообщения.Сообщение"), ПользовательПоКоду(СтрЗаменить(ИД, "answer_","")));		
	ИначеЕсли Лев(ИД, 5) = "doit_" Тогда

	
		
		ОбновитьСообщенияНаФорме();
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПользовательПоКоду(Код)
	
	Возврат Справочники.Пользователи.НайтиПоКоду(Код);

КонецФункции 

&НаКлиенте
Процедура СоздатьСообщение(Команда)
	Сооб_Клиент.СоздатьЗаписьРССообщения(Объект.Ссылка, ПредопределенноеЗначение("Перечисление.Сооб_ТипСообщения.Сообщение"));
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНапоминание(Команда)
	Сооб_Клиент.СоздатьЗаписьРССообщения(Объект.Ссылка, ПредопределенноеЗначение("Перечисление.Сооб_ТипСообщения.Напоминание"));
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПоручение(Команда)
	Сооб_Клиент.СоздатьЗаписьРССообщения(Объект.Ссылка, ПредопределенноеЗначение("Перечисление.Сооб_ТипСообщения.Поручение"));
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСообщенияНаФорме()

	КэшСообщений = Сооб_Сервер.СообщенияОбъекта(Объект.Ссылка);
	Элементы.КнопкаСообщения.Заголовок = НСтр("ru = 'Сообщения'; en = 'Messages'") + Формат(КэшСообщений.КоличествоСообщений, "ЧДЦ=0; ЧН=' '; ЧФ=' :Ч'");
	СообщенияОбъекта = КэшСообщений.СтрокаHTML;
	 
КонецПроцедуры

#КонецОбласти


#Область Треки
	
&НаКлиенте
Процедура ПоказатьТреки(Команда)
	
	Элементы.ГруппаТреки.Видимость 	= истина;
    Элементы.ГруппаТТН.Видимость	= Ложь; 
	ОтобразитьКоличествоТреков();
	
КонецПроцедуры

&НаКлиенте
Процедура СкрытьТреки(Команда)

	Элементы.ГруппаТреки.Видимость 	= Ложь;
    Элементы.ГруппаТТН.Видимость	= Истина; 
    ОтобразитьКоличествоТреков();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьКоличествоТреков()

	Элементы.ПоказатьТреки.Заголовок = СтрШаблон("%1 (%2)", НСтр("ru = 'Треки'; en = 'Tracks'"), Объект.Треки.Количество());	

КонецПроцедуры

&НаКлиенте
Процедура ТрекиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если Объект.Треки.Количество() > 0 Тогда
		Объект.Авианакладная = Объект.Треки[0].Трек;
		Объект.ДатаТТН = Объект.Треки[0].Дата;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТрекиПослеУдаления(Элемент)

	Если Объект.Треки.Количество() = 0 Тогда
		Объект.Авианакладная = "";
		Объект.ДатаТТН = Дата(1,1,1);	
	Иначе	
		Объект.Авианакладная = Объект.Треки[0].Трек;
		Объект.ДатаТТН = Объект.Треки[0].Дата;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура АвианакладнаяПриИзменении(Элемент)
	
	Если Объект.Треки.Количество() = 0 Тогда
   		СтрокаТЧ = Объект.Треки.Добавить();
	Иначе
		СтрокаТЧ = Объект.Треки[0];
	КонецЕсли;
	СтрокаТЧ.Трек = Объект.Авианакладная;
	
	Если НЕ ЗначениеЗаполнено(Объект.Авианакладная) И Объект.ДатаТТН = Дата(1,1,1) Тогда
		Если Объект.Треки.Количество() > 0 Тогда
		 	Объект.Треки.Удалить(0);
			ТрекиПослеУдаления(Неопределено);
		    ОтобразитьКоличествоТреков();
			клНамекнуть(НСтр("ru = 'Удаление данных'; en = 'Data deleting'"), НСтр("ru = 'Один трек удален из табличной части!'; en = 'One track has been removed from the tabular section!'"),  БиблиотекаКартинок.УдалитьЭлементСписка);
		КонецЕсли;;
	КонецЕсли;   
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаТТНПриИзменении(Элемент)

	Если Объект.Треки.Количество() = 0 Тогда
   		СтрокаТЧ = Объект.Треки.Добавить();
	Иначе
		СтрокаТЧ = Объект.Треки[0];
	КонецЕсли;
	СтрокаТЧ.Дата = Объект.ДатаТТН;
	
КонецПроцедуры

#КонецОбласти
